app/controllers/iterations_controller.rb

SELECT * FROM "iterations" WHERE ("iterations"."id" = 3)
---
  def show
    @iteration = Iteration.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = '20') LIMIT 1
---
  def new
    @project = Project.find(params[:project_id])

SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
---
  def edit
    @iteration = Iteration.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 2)
INSERT INTO "iterations" ("name", "created_at", "project_id", "updated_at", "end_on", "start_on", "description") VALUES('Brant''s Iteration', '2010-03-19 22:56:59', 2, '2010-03-19 22:56:59', '2010-04-21', '2010-04-19', 'All about Brant!')
---
  def create
    @project = Project.find(params[:project_id])
    if @project
      @iteration = @project.iterations.build(params[:iteration])
    else
      flash[:error] = 'Invalid Project specified'
    end

    respond_to do |format|
      if @iteration.save

SELECT * FROM "iterations" WHERE ('2010-03-07' between start_on and end_on and project_id = 2 and id != 3) LIMIT 1
UPDATE "iterations" SET "updated_at" = '2010-03-19 23:08:37', "created_at" = '2010-04-05 04:00:00' WHERE "id" = 1
---
  def update
    @iteration = Iteration.find(params[:id])

    respond_to do |format|
      if @iteration.update_attributes(params[:iteration])

SELECT * FROM "iterations" WHERE ("iterations"."id" = 7)
DELETE FROM "iterations" WHERE "id" = 7
---
  def destroy
    @iteration = Iteration.find(params[:id])
    @iteration.destroy