app/controllers/projects_controller.rb

  def index
    @projects ||= Project.find(:all,
                             :conditions => ["hidden = ?", false],
                             :order => :name)
---
SELECT * FROM "projects" WHERE (hidden = 'f') ORDER BY name

  def all
    @allprojects = Project.find(:all, :order => :name)
---
SELECT * FROM "projects" WHERE (hidden = 't')

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "description", "hidden") VALUES('Some Archived Project', '2010-03-09 04:43:54', '2010-03-09 04:43:54', 'Ain''t doin'' nutin'' wit dis.', 't')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 2)
UPDATE "projects" SET "updated_at" = '2010-03-23 03:31:25', "description" = 'Build a replacement for XPlanner that doesn''t require Tim''s workstation to run.

  def destroy
    @project = Project.find(params[:id])
    if @project.hidden?
      @project.destroy
    else
      @project.hidden = true
      @project.save!
---
SELECT * FROM "projects" WHERE ("projects"."id" = 5)
DELETE FROM "projects" WHERE "id" = 6
UPDATE "projects" SET "updated_at" = '2010-03-23 23:18:27', "hidden" = 't' WHERE "id" = 5