app/controllers/stories_controller.rb

  def show
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)

  def new
    @iteration = Iteration.find(params[:iteration_id])
---
SELECT * FROM "iterations" WHERE ("iterations"."id" = 2)

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 5)

  def create

    params[:story][:tracker] = nil
    params[:story][:customer] = nil

    @iteration = Iteration.find(params[:iteration_id])
    if @iteration
      @story = @iteration.stories.build(params[:story])
    else
      flash[:error] = 'Invalid Iteration specified.'
    end
    respond_to do |format|
      if @story && @story.save
---
SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
INSERT INTO "stories" ("name", "description", "iteration_id", "tracker_id", "customer_id", "estimate", "priority", "created_at", "updated_at") VALUES('Some stuff', '<p>Some other stuff</p>', 1, 2, NULL, 1, 1, '2010-03-30 04:26:07', '2010-03-30 04:26:07')

  def update
    params[:story][:tracker] = nil
    params[:story][:customer] = nil

    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 5)
UPDATE "stories" SET "updated_at" = '2010-03-25 23:17:37', "tracker_id" = 1 WHERE "id" = 5

  def destroy
    @story = Story.find(params[:id])
    @iteration = @story.iteration
    @story.destroy
---
SELECT * FROM "stories" WHERE ("stories"."id" = 4)
DELETE FROM "stories" WHERE "id" = 4