app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
---
  def show
    @task = Task.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 7)
---
  def new
    @story = Story.find(params[:story_id])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
---
  def edit
    @task = Task.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 7)
INSERT INTO "tasks" ("name", "description", "type", "disposition", "acceptor_id", "estimate", "complete", "story_id", "created_at", "updated_at") VALUES('Do Stuff', '<p>Get ''r done</p>', NULL, 'None', 2, 1, NULL, NULL, '2010-03-30 13:02:46', '2010-03-30 13:02:46')
---
  def create

    assign_params_acceptor

    @story = Story.find(params[:story_id])
    if @story
      @task = @story.tasks.build(params[:task])
    else
      flash[:error] = 'Invalid Story specified.'
    end
    respond_to do |format|
      if @task && @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "disposition" = 'Planned', "updated_at" = '2010-03-30 13:29:04' WHERE "id" = 2
---
  def update
    @task = Task.find(params[:id])
    @story = @task.story

    respond_to do |format|
      if @task.update_attributes(params[:task])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
DELETE FROM "tasks" WHERE "id" = 3
---
  def destroy
    @task = Task.find(params[:id])
    @story = @task.story
    @task.destroy

SELECT * FROM "tasks" WHERE ("tasks"."id" = 6)
UPDATE "tasks" SET "complete" = 't', "updated_at" = '2010-04-04 21:31:12' WHERE "id" = 6
---
  def complete
    @task = Task.find(params[:id])
    @task.complete = true
    @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 6)
UPDATE "tasks" SET "complete" = 'f', "updated_at" = '2010-04-04 21:43:29' WHERE "id" = 6
---
  def incomplete
    @task = Task.find(params[:id])
    @task.complete = false
    @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 9)
UPDATE "tasks" SET "complete" = 't', "updated_at" = '2010-04-04 21:58:23' WHERE "id" = 9
---
  def complete_quick
    @task = Task.find(params[:id])
    @story = @task.story
    @task.complete = true
    @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 9)
UPDATE "tasks" SET "complete" = 'f', "updated_at" = '2010-04-04 21:58:25' WHERE "id" = 9
---
  def incomplete_quick
    @task = Task.find(params[:id])
    @story = @task.story
    @task.complete = false
    @task.save