app/controllers/time_entries_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."id" = 8)
---
  def new
    @task = Task.find(params[:task_id])

SELECT * FROM "time_entries" WHERE ("time_entries"."id" = 1)
---
  def show
    @time_entry = TimeEntry.find(params[:id])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 8)
INSERT INTO "time_entries" ("duration", "person1_id", "person2_id", "task_id", "created_at", "updated_at") VALUES(2, 1, 1, 8, '2010-03-31 05:33:40', '2010-03-31 05:33:40')
---
  def create

    assign_params_persons

    @task = Task.find(params[:task_id])
    if @task
      @time_entry = @task.time_entries.build(params[:time_entry])
    else
      flash[:error] = 'Invalid Task specified.'
    end
    respond_to do |format|
      if @time_entry && @time_entry.save

SELECT * FROM "time_entries" WHERE ("time_entries"."id" = 3)
DELETE FROM "time_entries" WHERE "id" = 3
---
  def destroy
    @time_entry = TimeEntry.find(params[:id])
    @task = @time_entry.task
    @time_entry.destroy